УТ.КонтурЗакупки/src/InformationRegisters/КонтурЗакупки_УведомленияЛентаПользователя/КонтурЗакупки_УведомленияЛентаПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЗакупки_УведомленияЛентаПользователя</name>
  <resources>
    <name>Прочитано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаПрочтения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>НазваниеПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.КонтурЗакупки/src/InformationRegisters/КонтурЗакупки_УведомленияЛентаПользователя/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "КонтурУведомленияПрочитаноНеПрочитано" Тогда
		Найденные = ТабУведомлений.НайтиСтроки(Новый Структура("Идентификатор", Параметр.Идентификатор));
		Если Найденные.Количество() > 0 Тогда
			Найденные.Получить(0).Прочитано = Параметр.Прочитано;
			УправлениеВидимостьюДоступностью();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьТабУведомлений();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

//	ЗаполнитьТабУведомлений();

	УправлениеВидимостьюДоступностью();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если ЗавершениеРаботы = Истина Тогда
		Возврат;
	КонецЕсли;

	//@skip-check unknown-method-property
	ИнформацияПоУведомлениям = ИнформацияПоУведомлениям(Параметры.НазваниеПроекта, Параметры.ВерсияПроекта,
		Параметры.ИДКлиента, Истина);

	Если ЗначениеЗаполнено(ИнформацияПоУведомлениям.ИдентификаторВажногоНепрочитанного) Тогда

		ТекстВопроса = НСтр("ru='Имеются важные, но непрочитанные уведомления!
							|Вы можете прочитать их и отметить нажатием на кнопку Прочитано,
							|Либо отложить прочтение на %1 мин.?'");
		ТекстВопроса = СтрЗаменить(ТекстВопроса, "%1", ИнформацияПоУведомлениям.ИнтервалОжиданияМинут);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("Прочитать сейчас");
		Кнопки.Добавить("Прочитать позже");

		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработчикВопросПередЗакрытием", ЭтотОбъект);

		ПоказатьВопрос(ОповещениеОЗакрытии, ТекстВопроса, Кнопки, 60, , "Контур Уведомления");

		Отказ = Истина;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолеПросмотраДокументСформирован(Элемент)
	УправлениеВидимостьюДоступностью();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПрочитанныеПриИзменении(Элемент)

	ТабУведомленийУстановитьОтбор();
	УправлениеВидимостьюДоступностью();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабУведомлений
&НаКлиенте
Процедура ТабУведомленийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекДанные = Элементы.ТабУведомлений.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Важное");
	СтруктураПараметров.Вставить("Дата");
	СтруктураПараметров.Вставить("Заголовок");
	СтруктураПараметров.Вставить("Идентификатор");
	СтруктураПараметров.Вставить("Прочитано");
	СтруктураПараметров.Вставить("Текст");
	СтруктураПараметров.Вставить("НазваниеПроекта", Параметры.НазваниеПроекта);
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, ТекДанные);
	ИмяОткрываемойФормы = "РегистрСведений.КонтурЗакупки_УведомленияЛентаПользователя.Форма.ФормаОтдельногоУведомления";
	ОткрытьФорму(ИмяОткрываемойФормы, СтруктураПараметров, ЭтотОбъект);

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрочитаноНеПрочитано(Команда)

	ТекДанные = Элементы.ТабУведомлений.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		ТекДанные.Прочитано = Не ТекДанные.Прочитано;

		ПрочитаноНаСервере(Параметры.НазваниеПроекта, ТекДанные.Идентификатор, ТекДанные.Прочитано);
		ТабУведомленийУстановитьОтбор();
		УправлениеВидимостьюДоступностью();
		СтруктураПараметров = Новый Структура("Идентификатор, Прочитано", ТекДанные.Идентификатор, ТекДанные.Прочитано);
		Оповестить("КонтурУведомленияПрочитаноНеПрочитано", СтруктураПараметров);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТабУведомлений()

	ИнфоПоУведомлениям = РегистрыСведений.КонтурЗакупки_УведомленияЛентаПользователя.ИнформацияПоУведомлениям(
		Параметры.НазваниеПроекта, Параметры.ВерсияПроекта, Параметры.ИДКлиента, Ложь, Истина);

	ТабУведомлений.Загрузить(ИнфоПоУведомлениям.ТабУведомлений);

	ОтборПрочитано = Параметры.ОтборПрочитано;

	Если ЗначениеЗаполнено(ИнфоПоУведомлениям.ИдентификаторВажногоНепрочитанного) Тогда
		СтруктураПоиска = Новый Структура("Идентификатор", ИнфоПоУведомлениям.ИдентификаторВажногоНепрочитанного);

		СтрПозиционирования = ТабУведомлений.НайтиСтроки(СтруктураПоиска);
		Если СтрПозиционирования.Количество() > 0 Тогда
			Элементы.ТабУведомлений.ТекущаяСтрока = СтрПозиционирования.Получить(0).ПолучитьИдентификатор();
		КонецЕсли;

		ОтборПрочитано = ?(ОтборПрочитано = 2, 0, ОтборПрочитано);

	КонецЕсли;

	ТабУведомленийУстановитьОтбор();

КонецПроцедуры

&НаСервере
Процедура ТабУведомленийУстановитьОтбор()

	СтруктураПоиска = Новый Структура;

	Если ОтборПрочитано = 1 Тогда
		СтруктураПоиска.Вставить("Прочитано", Ложь);
	ИначеЕсли ОтборПрочитано = 2 Тогда
		СтруктураПоиска.Вставить("Прочитано", Истина);
//	Иначе
//		СтруктураПоиска = Новый Структура;
	КонецЕсли;

	Элементы.ТабУведомлений.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПрочитаноНаСервере(НазваниеПроекта, Идентификатор, Прочитано)

	РегистрыСведений.КонтурЗакупки_УведомленияЛентаПользователя.ОтметитьПрочитаннымОтложить(НазваниеПроекта,
		Идентификатор, Прочитано);

КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюДоступностью()

	ТекДанные = Элементы.ТабУведомлений.ТекущиеДанные; //Элементы.Список.ТекущиеДанные
	Если ТекДанные = Неопределено Тогда

		Элементы.ПрочитаноНеПрочитано.Доступность = Ложь;
		Элементы.ПрочитаноНеПрочитано.Заголовок = "Прочитано";
		Элементы.ПрочитаноНеПрочитано.ЦветФона = WebЦвета.Белый;

	Иначе

		Элементы.ПрочитаноНеПрочитано.Доступность = Истина;

		Если ТекДанные.Прочитано Тогда
			Элементы.ПрочитаноНеПрочитано.Заголовок = "Отметить непрочитанным";
			Элементы.ПрочитаноНеПрочитано.ЦветФона = WebЦвета.Белый;
		Иначе
			Элементы.ПрочитаноНеПрочитано.Заголовок = "Прочитано";
			Элементы.ПрочитаноНеПрочитано.ЦветФона = WebЦвета.Золотой;
		КонецЕсли;

	КонецЕсли;

	Элементы.ГруппаИнфоНепрочитанные.Видимость = ТабУведомлений.НайтиСтроки(Новый Структура("Прочитано",
		Ложь)).Количество() > 0;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ИнформацияПоУведомлениям(НазваниеПроекта, ВерсияПроекта, ИДКлиента, УчитыватьИнтервалОтложенных)

	Возврат РегистрыСведений.КонтурЗакупки_УведомленияЛентаПользователя.ИнформацияПоУведомлениям(НазваниеПроекта,
		ВерсияПроекта, ИДКлиента, УчитыватьИнтервалОтложенных);

КонецФункции

&НаСервереБезКонтекста
Процедура ОтложитьПрочтениеВажных(НазваниеПроекта, МассивИдентификаторов)

	РегистрыСведений.КонтурЗакупки_УведомленияЛентаПользователя.ОтложитьПрочтениеВажных(НазваниеПроекта,
		МассивИдентификаторов);

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВопросПередЗакрытием(Ответ, ДополнительныеРеквизиты) Экспорт

	Если Ответ = "Прочитать позже" Тогда

		МассивИдентификаторов = Новый Массив;

		СтруктураОтбора = Новый Структура("Важное, Прочитано", Истина, Ложь);
		МассивСтрок = ТабУведомлений.НайтиСтроки(СтруктураОтбора);
		Для Каждого Стр Из МассивСтрок Цикл
			МассивИдентификаторов.Добавить(Стр.Идентификатор);
		КонецЦикла;

		ОтложитьПрочтениеВажных(Параметры.НазваниеПроекта, МассивИдентификаторов);
		Закрыть();

	КонецЕсли;

КонецПроцедуры
#КонецОбласти
